Revit 2025 API
DisplayStyle Enumeration
 Display type of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DisplayStyle
Public Enumeration DisplayStyle
public enum class DisplayStyle
type DisplayStyle
Members
Member name | Value | Description
Undefined | 0 |  View does not use Render Type
Wireframe | 1 |  Wireframe
HLR | 2 |  Hidden Line Removal
Shading | 3 |  Shading
ShadingWithEdges | 4 |  Shading With Edges
Rendering | 5 |  Rendering
Realistic | 6 |  Realistic
FlatColors | 7 |  Flat Colors
RealisticWithEdges | 8 |  Realistic With Edges
Textures | 9 |  Textures
See Also
Reference
Autodesk.Revit.DB Namespace